# 游戏的脚本可置于此文件中。
# 声明此游戏使用的角色。颜色参数可使角色姓名着色。


#旁白
define a = Character(" ")

#主角
define xk = Character("萧凯")
define fl = Character("风烈")

#配角
define ml = Character("莫离") #时空守护者
define fy = Character("樊羽") #时空守护者
define hz = Character("孩子") #游园惊魂篇孩子
define wz = Character("？？") #未知



# 游戏在此开始。

label start:

    # 显示一个背景。此处默认显示占位图，但您也可以在图片目录添加一个文件
    # （命名为 bg room.png 或 bg room.jpg）来显示。

    scene bg room

    # 显示角色立绘。此处使用了占位图，但您也可以在图片目录添加命名为
    # eileen happy.png 的文件来将其替换掉。

    show xk happy

    # 此处显示各行对话。

    xk "您已创建一个新的 Ren'Py 游戏。"

    xk "当您完善了故事、图片和音乐之后，您就可以向全世界发布了！"

    # 此处为游戏结尾。

    return



# 第一话　南柯一梦——人情冷漠心灰冷，唯能寄意浮世梦。　
# 第二话　萍水相逢——黯然回首伤流年，但求与君初相见。　
# 第三话　野性蛮荒——背水一战不眠夜，勇武凶悍蛮荒血。　
# 第四话　塞翁失马——福祸更迭有天意，生死轮回无常理。　
# 第五话　生日礼物——夏风吹散心头苦，落雨涤净眼中雾。　
# 第六话　朴素誓言——红尘滚滚尽余欢，长路漫漫不胜寒。　
# 第七话　同床共枕——酒意微醺情难却，夜色朦胧心相悦。　
# 第八话　游园惊魂——善恶取舍争论起，咫尺天涯恐别离。　
# 第九话　水月镜花——聚散莫测泪凄楚，分合难料梦荒芜。　
# 第十话　血脉交融——因爱甘心入虎口，为情宁愿舍乡愁。　

#番外篇之一　莫离——无法传达的爱　（13000点历练解锁）
#番外篇之二　风烈——夜空下的思念　（15000点历练解锁）
#番外篇之三　萧凯——南柯梦　　　　（17000点历练解锁）
#番外篇之四　真相——两难抉择　　　（无限制）　　　　





label chapter1:
    a "月华澄澈，星海斑斓。"
    a "万顷流光洒落而下，在氤氲的湖水中碎袈成点点灵动的璀璨。"
    a "夜色正浓，柔风轻拂，四丿司颇为寂静。"
    a "唯有几泓山泉潺潺流淌，蜿蜒穿过凌乱的碎石与落叶，最终消失在重峦叠嶂的远方。"
    a "稀薄的雾气弥漫于草木之间，渲染出如梦似幻的氛围。"
    a "在一片朦胧里，一个魁梧剽悍的身影由远及近。"
    a "稳重的步伐、壮硕的胸膛、结实的肩膀、锋利的獠牙、如炬的目光、警觉的尖耳。"
    a "以及，那一条修长有力、随性摆动的尾巴。"
    a "这只正逢壮年的虎兽人，有着罕见的雪自色绒毛。"
    a "墨黑的条纹以背脊为中心，向两侧伸展，上至额头，下达尾端，渐隐于腹部和胸前。"
    a "在细密的绒毛之下，棱角分明的肌肉依旧清晰可辨，雄浑的王者之气毫不吝啬地从中喷薄而出。"
    a "他径直来到湖边，脱去了仅有的一条兽皮短裤，随后纵身跃入水中。"
    a "待到层层叠叠的波纹完全平静后，才探出头来。"
    a "出于猫科动物的本能，他条件及射式地抖动着身体，甩落万千水滴。"
    a "在湖而形成了一场短暂的局部降雨。"
    a "湖水并不算深，只没过了虎兽人的腰部。"
    a "他川巨大的手掌捧起一掬清洌，从头顶猛然洒下一声虎啸。"
    a "沁润心脾的凉爽让他颇感舒适，全身的绒毛都不由自主地立了起来。"
    a "就连尾巴也变得十分躁动，凌空舞出一条条狂野的弧线。"
    a "一道水痕从虎兽人的脸侧滑落而下。"
    a "经过了粗壮的脖颈，穿过了起伏的胸膛，爬过了轮旆突出的腹肌。"
    a "那些浑然天成的线条仿佛蕴合着川之不竭的野性力量。"
    a "偶尔惊鸿一瞥，便足以让人血脉债张。"
    a "雾色渐浓，缓慢但却坚定地将虎兽人笼罩其中。"
    a "山泉的声音也变得愈发剌耳，夹杂着些许急促和不安。"
    a "突然，整个世界剧烈地晃动起来，以肉眼可见的速度崩塌瓦解。"
    a "月光颤抖，星辰坠落。"
    a "漫无边际的黑暗从四而八方汹涌而至，吞噬万物。"
    a "枕边，闹钟已经吗响多时。"
    return
    
    
    


label chapter2:
    return    


label chapter3:
    return


label chapter4:
    return


label chapter5:
    return


label chapter6:
    return


label chapter7:
    return


label chapter8:
    return


label chapter9:
    return


label chapter10:
    return


label extra_chapter1:
    return

label extra_chapter2:
    return

label extra_chapter3:
    return
    
label extra_chapter4:
    return
